
&НаКлиенте
Процедура КомандаВыполнитьВыгрузку(Команда)
	ВыполнитьВыгрузкуНаСервере();
КонецПроцедуры


&НаСервере
Процедура  ВыполнитьВыгрузкуНаСервере() 
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ВыгружатьДопРеквизиты =  Объект.НастройкиВыгрузкиДопРеквизитов.НайтиСтроки(Новый Структура("Выгружать",Истина)).Количество() <>0;
	
	СообщениеРезультата = "";
	ОбъектОбработки.СформироватьФайлCSV(Ложь,СообщениеРезультата,ВыгружатьДопРеквизиты);
	Сообщить(СообщениеРезультата);
КонецПроцедуры	


&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка=ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог";
	Диалог.ПолноеИмяФайла = "";  
    Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
		Объект.ПутьККаталогу = Диалог.Каталог;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ПроверитьСовместимостьКонфигурации();
	
	ОбъектОбработки.ЗаполнитьТабчастьДопРеквизиты();
	
	ОбъектОбработки.ВосстановитьНастройки();
	
	ЗначениеВРеквизитФормы(ОбъектОбработки,"Объект");
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ПутьККаталогу",Объект.ПутьККаталогу);
	СтруктураНастроек.Вставить("Склад",Объект.Склад);
	СтруктураНастроек.Вставить("ВидЦены",Объект.ВидЦены);
	СтруктураНастроек.Вставить("НастройкиВыгрузкиДопРеквизитов",Объект.НастройкиВыгрузкиДопРеквизитов.Выгрузить());
	
	КлючОбъекта =  "ВнешняяОбработка.ВыгрузкаДанныхПоНоменклатуре.Форма.Форма/ТекущиеДанные";
	
	ХранилищеСистемныхНастроек.Сохранить(КлючОбъекта,,СтруктураНастроек,ПользователиИнформационнойБазы.ТекущийПользователь());

	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыгружатьДопРеквизитыНаСервере()
	Для Каждого Стр Из Объект.НастройкиВыгрузкиДопРеквизитов Цикл 
		Стр.Выгружать = Истина;		
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгружатьДопРеквизиты(Команда)
	КомандаВыгружатьДопРеквизитыНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОтменитьДопРеквизитыНаСервере()
	Для Каждого Стр Из Объект.НастройкиВыгрузкиДопРеквизитов Цикл 
		Стр.Выгружать = Ложь;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьДопРеквизиты(Команда)
	КомандаОтменитьДопРеквизитыНаСервере();
КонецПроцедуры
