Перем ВыгружатьДопРеквизиты;

Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	
	ПараметрыРегистрации.Вставить("Наименование", "ВыгрузкаДанныхПоНоменклатуре");
	ПараметрыРегистрации.Вставить("Версия", "1.0"); 
	ПараметрыРегистрации.Вставить("Информация", "Выгрузка данных но номенклатуре(Характеристики,Доп. реквизиты, остатки и цены)");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	Команды = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(Команды, "Фоновая Выгрузка",
	                         "ФоноваяВыгрузкаДанныхПоНоменклатуре",
							 "ВызовСерверногоМетода",
							 Ложь,
							 "");
	ПараметрыРегистрации.Вставить("Команды", Команды);

	Возврат ПараметрыРегистрации;
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры


Процедура ВыполнитьКоманду(ИдентификаторКоманды) Экспорт
	
	Если ИдентификаторКоманды = "ФоноваяВыгрузкаДанныхПоНоменклатуре"    Тогда
		СформироватьФайлCSV();
	КонецЕсли;
	
КонецПроцедуры


	


Процедура ЗаполнитьТабчастьДопРеквизиты() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРеквизитыИСведения.Ссылка КАК Свойство
		|ПОМЕСТИТЬ ТЗСвойства
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		|ГДЕ
		|	НЕ ДополнительныеРеквизитыИСведения.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗСвойства.Свойство КАК ДопРеквизит,
		|	ИСТИНА КАК Выгружать
		|ИЗ
		|	ТЗСвойства КАК ТЗСвойства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
		|		ПО ТЗСвойства.Свойство = ДополнительныеРеквизиты.Свойство
		|ГДЕ
		|	ДополнительныеРеквизиты.Свойство В
		|			(ВЫБРАТЬ
		|				ТЗСвойства.Свойство КАК Свойство
		|			ИЗ
		|				ТЗСвойства КАК ТЗСвойства)
		|	И НЕ ДополнительныеРеквизиты.Ссылка.ЭтоГруппа
		|	И ДополнительныеРеквизиты.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НастройкиВыгрузкиДопРеквизитов.Очистить();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НастройкиВыгрузкиДопРеквизитов.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	
	
	
КонецПроцедуры	



Функция  ПолучитьДанныеВыгрузки() Экспорт 
	 ТЗВыгрузки = НастройкиВыгрузкиДопРеквизитов.Выгрузить(Новый Структура("Выгружать",Истина));
	 
	 ВыгрузатьДопРеквизиты =  ТЗВыгрузки.Количество() > 0;
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = ПолучитьТекстЗапроса();	 
	 Запрос.УстановитьПараметр("ВидЦен",ВидЦены);
	 Запрос.УстановитьПараметр("Склад",Склад);
	 Запрос.УстановитьПараметр("ДопРеквизитыДляВыгрузки",ТЗВыгрузки.ВыгрузитьКолонку("ДопРеквизит"));
	 Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	   
	 Возврат Выборка;
	 
	
 КонецФункции	
 
 
 Функция ПолучитьТекстЗапроса()
	 
	 ТекущаяКонфигурация = Метаданные.Имя;
	 
	 Если ТекущаяКонфигурация = "Розница" Или ТекущаяКонфигурация = "РозницаДляАзербайджана" Тогда 
		 Возврат ПолучитьТекстЗапросаРозница();
	 Иначе 
		 Возврат ПолучитьТекстЗапросаУТ_УП();
	 КонецЕсли;	 
	 
 КонецФункции	 
 
 Функция ПолучитьТекстЗапросаУТ_УП()
	 ТекстЗапроса = "ВЫБРАТЬ
	                |	ТЗНоменклатура.Ссылка КАК Номенклатура,
	                |	ТЗНоменклатура.Код КАК Код,
	                |	ТЗНоменклатура.Артикул КАК Артикул
	                |ПОМЕСТИТЬ ТЗСправочникНоменклатура
	                |ИЗ
	                |	Справочник.Номенклатура КАК ТЗНоменклатура
	                |ГДЕ
	                |	НЕ ТЗНоменклатура.ЭтоГруппа
	                |	И НЕ ТЗНоменклатура.ПометкаУдаления
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	                |	ТЗСправочникНоменклатура.Номенклатура КАК Номенклатура
	                |ПОМЕСТИТЬ ТЗХарактеристик
	                |ИЗ
	                |	ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                |		ПО ТЗСправочникНоменклатура.Номенклатура = ХарактеристикиНоменклатуры.Владелец
	                |ГДЕ
	                |	ХарактеристикиНоменклатуры.Владелец В
	                |			(ВЫБРАТЬ
	                |				ТЗСправочникНоменклатура.Номенклатура КАК Номенклатура
	                |			ИЗ
	                |				ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура)
	                |	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ТЗСправочникНоменклатура.Номенклатура КАК Номенклатура,
	                |	ЕСТЬNULL(ТЗХарактеристик.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	                |ПОМЕСТИТЬ ТЗИтоговаяХарактеристики
	                |ИЗ
	                |	ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗХарактеристик КАК ТЗХарактеристик
	                |		ПО ТЗСправочникНоменклатура.Номенклатура = ТЗХарактеристик.Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ТЗИтоговаяХарактеристики.Номенклатура КАК Номенклатура,
	                |	ТЗИтоговаяХарактеристики.Характеристика КАК Характеристика,
	                |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	                |ПОМЕСТИТЬ ТЗЦены
	                |ИЗ
	                |	ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                |				,
	                |				(Номенклатура, Характеристика) В
	                |						(ВЫБРАТЬ
	                |							ТЗИтоговаяХарактеристики.Номенклатура КАК Номенклатура,
	                |							ТЗИтоговаяХарактеристики.Характеристика КАК Характеристика
	                |						ИЗ
	                |							ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики)
	                |					И ВидЦены = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
	                |		ПО ТЗИтоговаяХарактеристики.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	                |			И ТЗИтоговаяХарактеристики.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ТЗИтоговаяХарактеристики.Номенклатура КАК Номенклатура,
	                |	ТЗИтоговаяХарактеристики.Характеристика КАК Характеристика,
	                |	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеПодЗаказОстаток, 0)) КАК Остаток
	                |ПОМЕСТИТЬ ТЗОстатки
	                |ИЗ
	                |	ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(
	                |				,
	                |				(Номенклатура, Характеристика) В
	                |						(ВЫБРАТЬ
	                |							ТЗИтоговаяХарактеристики.Номенклатура КАК Номенклатура,
	                |							ТЗИтоговаяХарактеристики.Характеристика КАК Характеристика
	                |						ИЗ
	                |							ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики)
	                |					И Склад = &Склад) КАК СвободныеОстаткиОстатки
	                |		ПО ТЗИтоговаяХарактеристики.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
	                |			И ТЗИтоговаяХарактеристики.Характеристика = СвободныеОстаткиОстатки.Характеристика
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ТЗИтоговаяХарактеристики.Номенклатура,
	                |	ТЗИтоговаяХарактеристики.Характеристика
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	                |	ТЗИтоговаяХарактеристики.Номенклатура КАК Номенклатура,
	                |	ТЗИтоговаяХарактеристики.Характеристика КАК Характеристика
	                |ПОМЕСТИТЬ ТЗШтрихкоды
	                |ИЗ
	                |	ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                |		ПО ТЗИтоговаяХарактеристики.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	                |			И ТЗИтоговаяХарактеристики.Характеристика = ШтрихкодыНоменклатуры.Характеристика
	                |ГДЕ
	                |	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
	                |			(ВЫБРАТЬ
	                |				ТЗИтоговаяХарактеристики.Номенклатура КАК Номенклатура,
	                |				ТЗИтоговаяХарактеристики.Характеристика КАК Характеристика
	                |			ИЗ
	                |				ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ТЗСправочникНоменклатура.Номенклатура КАК Номенклатура,
	                |	НоменклатураДополнительныеРеквизиты.Свойство КАК ИмяДопРеквизита,
	                |	НоменклатураДополнительныеРеквизиты.Значение КАК ЗначениеДопРеквизита
	                |ПОМЕСТИТЬ ТЗДанныеДопРеквизитов
	                |ИЗ
	                |	ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	                |		ПО ТЗСправочникНоменклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	                |ГДЕ
	                |	НоменклатураДополнительныеРеквизиты.Ссылка В
	                |			(ВЫБРАТЬ
	                |				ТЗСправочникНоменклатура.Номенклатура КАК Номенклатура
	                |			ИЗ
	                |				ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура)
	                |	И НоменклатураДополнительныеРеквизиты.Свойство В(&ДопРеквизитыДляВыгрузки)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	NULL КАК Номенклатура,
	                |	NULL КАК Характеристика,
	                |	NULL КАК Штрихкод,
	                |	ТЗДанныеДопРеквизитов.ИмяДопРеквизита КАК ИмяДопРеквизита,
	                |	NULL КАК ЗначениеДопРеквизита,
	                |	NULL КАК ТипДанных,
	                |	""НазванияДопРеквизитов"" КАК Вид,
	                |	NULL КАК Цена,
	                |	NULL КАК Остаток
	                |ИЗ
	                |	ТЗДанныеДопРеквизитов КАК ТЗДанныеДопРеквизитов
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ТЗДанныеДопРеквизитов.ИмяДопРеквизита
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ТЗСправочникНоменклатура.Номенклатура,
	                |	ТЗИтоговаяХарактеристики.Характеристика,
	                |	ТЗШтрихкоды.Штрихкод,
	                |	NULL,
	                |	NULL,
	                |	""Характеристики"",
	                |	""ДанныеНом"",
	                |	ТЗЦены.Цена,
	                |	ТЗОстатки.Остаток
	                |ИЗ
	                |	ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики
	                |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗШтрихкоды КАК ТЗШтрихкоды
	                |			ПО ТЗИтоговаяХарактеристики.Характеристика = ТЗШтрихкоды.Характеристика
	                |				И ТЗИтоговаяХарактеристики.Номенклатура = ТЗШтрихкоды.Номенклатура
	                |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗЦены КАК ТЗЦены
	                |			ПО ТЗИтоговаяХарактеристики.Номенклатура = ТЗЦены.Номенклатура
	                |				И ТЗИтоговаяХарактеристики.Характеристика = ТЗЦены.Характеристика
	                |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗОстатки КАК ТЗОстатки
	                |			ПО ТЗИтоговаяХарактеристики.Номенклатура = ТЗОстатки.Номенклатура
	                |				И ТЗИтоговаяХарактеристики.Характеристика = ТЗОстатки.Характеристика
	                |		ПО ТЗСправочникНоменклатура.Номенклатура = ТЗИтоговаяХарактеристики.Номенклатура
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ТЗСправочникНоменклатура.Номенклатура,
	                |	NULL,
	                |	NULL,
	                |	ТЗДанныеДопРеквизитов.ИмяДопРеквизита,
	                |	ТЗДанныеДопРеквизитов.ЗначениеДопРеквизита,
	                |	""ДопРеквизиты"",
	                |	""ДанныеНом"",
	                |	NULL,
	                |	NULL
	                |ИЗ
	                |	ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗДанныеДопРеквизитов КАК ТЗДанныеДопРеквизитов
	                |		ПО ТЗСправочникНоменклатура.Номенклатура = ТЗДанныеДопРеквизитов.Номенклатура
	                |ИТОГИ ПО
	                |	Вид,
	                |	Номенклатура,
	                |	ТипДанных";
	

	Возврат ТекстЗапроса;
	 
 КонецФункции	 
 
 
 Функция ПолучитьТекстЗапросаРозница()
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТЗНоменклатура.Ссылка КАК Номенклатура,
	               |	ТЗНоменклатура.Код КАК Код,
	               |	ТЗНоменклатура.Артикул КАК Артикул
	               |ПОМЕСТИТЬ ТЗСправочникНоменклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК ТЗНоменклатура
	               |ГДЕ
	               |	НЕ ТЗНоменклатура.ЭтоГруппа
	               |	И НЕ ТЗНоменклатура.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	               |	ТЗСправочникНоменклатура.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ТЗХарактеристик
	               |ИЗ
	               |	ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |		ПО ТЗСправочникНоменклатура.Номенклатура = ХарактеристикиНоменклатуры.Владелец
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Владелец В
	               |			(ВЫБРАТЬ
	               |				ТЗСправочникНоменклатура.Номенклатура КАК Номенклатура
	               |			ИЗ
	               |				ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура)
	               |	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗСправочникНоменклатура.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ТЗХарактеристик.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	               |ПОМЕСТИТЬ ТЗИтоговаяХарактеристики
	               |ИЗ
	               |	ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗХарактеристик КАК ТЗХарактеристик
	               |		ПО ТЗСправочникНоменклатура.Номенклатура = ТЗХарактеристик.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗИтоговаяХарактеристики.Номенклатура КАК Номенклатура,
	               |	ТЗИтоговаяХарактеристики.Характеристика КАК Характеристика,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ПОМЕСТИТЬ ТЗЦены
	               |ИЗ
	               |	ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |				,
	               |				(Номенклатура, Характеристика) В
	               |						(ВЫБРАТЬ
	               |							ТЗИтоговаяХарактеристики.Номенклатура КАК Номенклатура,
	               |							ТЗИтоговаяХарактеристики.Характеристика КАК Характеристика
	               |						ИЗ
	               |							ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики)
	               |					И ВидЦены = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТЗИтоговаяХарактеристики.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |			И ТЗИтоговаяХарактеристики.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗИтоговаяХарактеристики.Номенклатура КАК Номенклатура,
	               |	ТЗИтоговаяХарактеристики.Характеристика КАК Характеристика,
	               |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)) КАК Остаток
	               |ПОМЕСТИТЬ ТЗОстатки
	               |ИЗ
	               |	ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |				,
	               |				(Номенклатура, Характеристика) В
	               |						(ВЫБРАТЬ
	               |							ТЗИтоговаяХарактеристики.Номенклатура КАК Номенклатура,
	               |							ТЗИтоговаяХарактеристики.Характеристика КАК Характеристика
	               |						ИЗ
	               |							ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики)
	               |					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	               |		ПО ТЗИтоговаяХарактеристики.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	               |			И ТЗИтоговаяХарактеристики.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТЗИтоговаяХарактеристики.Номенклатура,
	               |	ТЗИтоговаяХарактеристики.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Штрихкоды.Штрихкод КАК Штрихкод,
	               |	ТЗИтоговаяХарактеристики.Номенклатура КАК Номенклатура,
	               |	ТЗИтоговаяХарактеристики.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ ТЗШтрихкоды
	               |ИЗ
	               |	ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	               |		ПО ТЗИтоговаяХарактеристики.Номенклатура = Штрихкоды.Владелец
	               |			И ТЗИтоговаяХарактеристики.Характеристика = Штрихкоды.Характеристика
	               |ГДЕ
	               |	(Штрихкоды.Владелец, Штрихкоды.Характеристика) В
	               |			(ВЫБРАТЬ
	               |				ТЗИтоговаяХарактеристики.Номенклатура КАК Номенклатура,
	               |				ТЗИтоговаяХарактеристики.Характеристика КАК Характеристика
	               |			ИЗ
	               |				ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗСправочникНоменклатура.Номенклатура КАК Номенклатура,
	               |	НоменклатураДополнительныеРеквизиты.Свойство КАК ИмяДопРеквизита,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК ЗначениеДопРеквизита
	               |ПОМЕСТИТЬ ТЗДанныеДопРеквизитов
	               |ИЗ
	               |	ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ПО ТЗСправочникНоменклатура.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ТЗСправочникНоменклатура.Номенклатура КАК Номенклатура
	               |			ИЗ
	               |				ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура)
	               |	И НоменклатураДополнительныеРеквизиты.Свойство В(&ДопРеквизитыДляВыгрузки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	NULL КАК Номенклатура,
	               |	NULL КАК Характеристика,
	               |	NULL КАК Штрихкод,
	               |	ТЗДанныеДопРеквизитов.ИмяДопРеквизита КАК ИмяДопРеквизита,
	               |	NULL КАК ЗначениеДопРеквизита,
	               |	NULL КАК ТипДанных,
	               |	""НазванияДопРеквизитов"" КАК Вид,
	               |	NULL КАК Цена,
	               |	NULL КАК Остаток
	               |ИЗ
	               |	ТЗДанныеДопРеквизитов КАК ТЗДанныеДопРеквизитов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТЗДанныеДопРеквизитов.ИмяДопРеквизита
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТЗСправочникНоменклатура.Номенклатура,
	               |	ТЗИтоговаяХарактеристики.Характеристика,
	               |	ТЗШтрихкоды.Штрихкод,
	               |	NULL,
	               |	NULL,
	               |	""Характеристики"",
	               |	""ДанныеНом"",
	               |	ТЗЦены.Цена,
	               |	ТЗОстатки.Остаток
	               |ИЗ
	               |	ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗИтоговаяХарактеристики КАК ТЗИтоговаяХарактеристики
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗШтрихкоды КАК ТЗШтрихкоды
	               |			ПО ТЗИтоговаяХарактеристики.Характеристика = ТЗШтрихкоды.Характеристика
	               |				И ТЗИтоговаяХарактеристики.Номенклатура = ТЗШтрихкоды.Номенклатура
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗЦены КАК ТЗЦены
	               |			ПО ТЗИтоговаяХарактеристики.Номенклатура = ТЗЦены.Номенклатура
	               |				И ТЗИтоговаяХарактеристики.Характеристика = ТЗЦены.Характеристика
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗОстатки КАК ТЗОстатки
	               |			ПО ТЗИтоговаяХарактеристики.Номенклатура = ТЗОстатки.Номенклатура
	               |				И ТЗИтоговаяХарактеристики.Характеристика = ТЗОстатки.Характеристика
	               |		ПО ТЗСправочникНоменклатура.Номенклатура = ТЗИтоговаяХарактеристики.Номенклатура
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТЗСправочникНоменклатура.Номенклатура,
	               |	NULL,
	               |	NULL,
	               |	ТЗДанныеДопРеквизитов.ИмяДопРеквизита,
	               |	ТЗДанныеДопРеквизитов.ЗначениеДопРеквизита,
	               |	""ДопРеквизиты"",
	               |	""ДанныеНом"",
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	ТЗСправочникНоменклатура КАК ТЗСправочникНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗДанныеДопРеквизитов КАК ТЗДанныеДопРеквизитов
	               |		ПО ТЗСправочникНоменклатура.Номенклатура = ТЗДанныеДопРеквизитов.Номенклатура
	               |ИТОГИ ПО
	               |	Вид,
	               |	Номенклатура,
	               |	ТипДанных";
	

	Возврат ТекстЗапроса;
	 
 КонецФункции	 
 
 
 Процедура СформироватьФайлCSV(АвтоВыгрузка = Истина,СообщениеРезультата = "",ВыгружатьДопРеквизиты = Истина) Экспорт 
	 
	 Если АвтоВыгрузка Тогда 
		 ВосстановитьНастройки();
	 КонецЕсли;
	 
	 ДанныеВыгрузки = ПолучитьДанныеВыгрузки();
	 
	 ТекстовыйФайл = Новый ТекстовыйДокумент;
	 
	 
	 
	 Если Не ВыгружатьДопРеквизиты Тогда 
		 ТекстовыйФайл.ДобавитьСтроку("Наименование;Артикул;Код;Штрихкод;Характеристика;Цена;Остаток;");
	 КонецЕсли;

	 
	 
	 Пока ДанныеВыгрузки.Следующий() Цикл 
		 
		
		 ВыборкаВид = ДанныеВыгрузки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		 
		 СтрокаВыгрузки = "";
		 
		 Пока ВыборкаВид.Следующий() Цикл 
			 
			 ВыборкаТип = ВыборкаВид.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			 
			 Пока ВыборкаТип.Следующий() Цикл 
				 
				 
				 Если ВыборкаТип.ТипДанных = "ДопРеквизиты" Тогда 
				    Продолжить; 
				 КонецЕсли;	 
				 
				 
				 
				 ВыборкаДетальныеЗаписи = ВыборкаТип.Выбрать();
				 
				 СтрокаВыгрузки =  "Наименование;Артикул;Код;Штрихкод;Характеристика;Цена;Остаток;";
				 
				 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					 
					 Если ДанныеВыгрузки.Вид = "НазванияДопРеквизитов" Тогда 
						 СтрокаВыгрузки = СтрокаВыгрузки + Строка(ВыборкаДетальныеЗаписи.ИмяДопРеквизита) + ";";
					 Иначе 
						 СтрокаВыгрузки = Строка(ВыборкаДетальныеЗаписи.Номенклатура) + ";" + ВыборкаДетальныеЗаписи.Номенклатура.Артикул + ";" + 
						 ВыборкаДетальныеЗаписи.Номенклатура.Код + ";" +  ВыборкаДетальныеЗаписи.Штрихкод  + ";" +  Строка(ВыборкаДетальныеЗаписи.Характеристика)  + ";" +
						 Формат(ВыборкаДетальныеЗаписи.Цена,"ЧЦ=15; ЧДЦ=2") + ";" + Формат(ВыборкаДетальныеЗаписи.Остаток,"ЧЦ=15; ЧДЦ=2") + ";" ;
						 
						 
						 СтруктураПоиска = Новый Структура("Номенклатура, ТипДанных");
						 СтруктураПоиска.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
						 СтруктураПоиска.ТипДанных = "ДопРеквизиты";
						 Пока ВыборкаТип.НайтиСледующий(СтруктураПоиска) Цикл
							 ВыборкаДетальныеЗаписиДопРеквизиты =  ВыборкаТип.Выбрать();							 
							 Пока ВыборкаДетальныеЗаписиДопРеквизиты.Следующий() Цикл 
								 СтрокаВыгрузки = СтрокаВыгрузки + Строка(ВыборкаДетальныеЗаписиДопРеквизиты.ЗначениеДопРеквизита) + ";";								 
							 КонецЦикла;	 							 
						 КонецЦикла;
						 ТекстовыйФайл.ДобавитьСтроку(СтрокаВыгрузки);
						 
					 КонецЕсли;
					 					 					 										
				 КонецЦикла;
				 
				  Если ДанныеВыгрузки.Вид = "НазванияДопРеквизитов" Тогда 
                       ТекстовыйФайл.ДобавитьСтроку(СтрокаВыгрузки);
				  КонецЕсли;	  
				 
			 КонецЦикла;	 
			 
			 
		 КонецЦикла;	 
		 
		 
	 КонецЦикла;	 
	 
	 ИмяФайла = "1C_Export"  + " " + Формат(ТекущаяДата(),"ДФ='dd.MM.yyyy ЧЧ_мм_сс'") + ".csv";
	 
	 ПутьСохранения =  ПутьККаталогу;
	 
	 Если СтрДлина(ПутьККаталогу) = 3 Тогда 
		 ПутьСохранения = ПутьСохранения  +  "ExportFrom1C" ;
		 
		 СоздатьКаталог(ПутьСохранения)
	 КонецЕсли;	 
	 
	 Попытка
		 ТекстовыйФайл.Записать(ПутьСохранения + "/" + ИмяФайла);
		 СообщениеРезультата = "Выгрузка данных завершена.";
	 Исключение
		 СообщениеРезультата = ОписаниеОшибки();
	 КонецПопытки;
	 
	 	 
 КонецПроцедуры	 
 
 
 Процедура ПроверитьСовместимостьКонфигурации() Экспорт 
	 ТекущаяКонфигурация = Метаданные.Имя;
	 
	 СписокДоступныхКонфигураций = Новый СписокЗначений;
	 СписокДоступныхКонфигураций.Добавить("УправлениеТорговлей");
	 СписокДоступныхКонфигураций.Добавить("УправлениеТорговлейДляАзербайджана");
	 СписокДоступныхКонфигураций.Добавить("РозницаДляАзербайджана");
	 СписокДоступныхКонфигураций.Добавить("Розница");
	 СписокДоступныхКонфигураций.Добавить("УправлениеПредприятием");
	 
	 
	 Если СписокДоступныхКонфигураций.НайтиПоЗначению(ТекущаяКонфигурация) = Неопределено Тогда 
		 ВызватьИсключение "Текущая конфигурация не поддерживается!" ;  
	 КонецЕсли;	 
	 
	 
 КонецПроцедуры	 
 
 
 
 Процедура ВосстановитьНастройки() Экспорт 
	 КлючОбъекта =  "ВнешняяОбработка.ВыгрузкаДанныхПоНоменклатуре.Форма.Форма/ТекущиеДанные";
	 
	 Отбор = Новый Структура;
	 Отбор.Вставить("Пользователь", ПользователиИнформационнойБазы.ТекущийПользователь());
	 Отбор.Вставить("КлючОбъекта", КлючОбъекта);
	 Выборка = ХранилищеСистемныхНастроек.Выбрать(Отбор);
	 Выборка.Следующий(); 
	 
	 Если Выборка.Настройки = Неопределено Тогда 
		 Возврат;
	 КонецЕсли;	 
	 
	 Если Не ЗначениеЗаполнено(Склад) Тогда 
		 Склад = Выборка.Настройки.Склад;
	 КонецЕсли;	 
	 
	 
	 Если Не ЗначениеЗаполнено(ВидЦены) Тогда 
		 ВидЦены = Выборка.Настройки.ВидЦены;
	 КонецЕсли;
	 
	 Если Выборка.Настройки.НастройкиВыгрузкиДопРеквизитов.Количество() <> 0 Тогда 
		 НастройкиВыгрузкиДопРеквизитов.Загрузить(Выборка.Настройки.НастройкиВыгрузкиДопРеквизитов);
	 КонецЕсли;
	 
	 
	 Если Не ЗначениеЗаполнено(ПутьККаталогу) Тогда 
		 ПутьККаталогу = Выборка.Настройки.ПутьККаталогу;		 
	 КонецЕсли;	 
	 
 КонецПроцедуры	 
 
 
 

 